<?php
    if(!isset($_GET['app'])){
        require_once("modules/dashboard/views/index.inc.php");
    }else if($_GET['app'] == "notification"){
        require_once("modules/notification/views/index.inc.php");
    }
    
    /* ----------------------------------- ระบบพื้นฐาน --------------------------------- */
    
    else if($_GET['app'] == "employee"){
        require_once("modules/user/views/index.inc.php");
    }else if($_GET['app'] == "employee_position"){
        require_once("modules/user_position/views/index.inc.php");
    }else if($_GET['app'] == "employee_license"){
        require_once("modules/user_license/views/index.inc.php");
    }


    else if($_GET['app'] == "company"){
        require_once("modules/company/views/index.inc.php");
    }else if($_GET['app'] == "employee_position"){
        require_once("modules/user_position/views/index.inc.php");
    }else if($_GET['app'] == "employee_license"){
        require_once("modules/user_license/views/index.inc.php");
    }
    

    
   
    /* ----------------------------------- //ระบบพื้นฐาน// ---------------------------------------------- */
    


    /* ----------------------------------- ระบบสั่งสินค้าทดลอง ---------------------------------------------- */
    
    

    /* ----------------------------------- //ระบบสั่งสินค้าทดลอง// ---------------------------------------------- */
   



    /* ----------------------------------- ระบบจัดซื้อ ---------------------------------------------- */

    /* ----------------------------------- //ระบบจัดซื้อ// ---------------------------------------------- */
    
    
    
    
    
    /* ----------------------------------- ระบบขายสินค้า ---------------------------------------------- */

    
    
    /* ----------------------------------- //ระบบขายสินค้า// ---------------------------------------------- */
   

    /* ----------------------------------- ระบบบัญชี ---------------------------------------------- */

    
    

    /* ----------------------------------- //ระบบบัญชี// ---------------------------------------------- */


    /* ----------------------------------- ระบบรายงาน ---------------------------------------------- */

  
    /* ----------------------------------- //ระบบรายงาน// ---------------------------------------------- */
   



    /* ----------------------------------- ระบบคลังสินค้า ---------------------------------------------- */
 

    /* ----------------------------------- //ระบบคลังสินค้า// ---------------------------------------------- */
   
    


    else if($_GET['app'] == "job"){
        require_once("modules/job/views/index.inc.php");
    }

?>